# CLASE 5 : PANDAS

# Ejemplo - Titanic

El fichero [titanic.csv] contiene información sobre los pasajeros del Titanic. Escribir un programa con los siguientes requisitos:

1. Generar un DataFrame con los datos del fichero.
2. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 5 primeras filas, las 5 últimas filas y una muestra aleatoria de 5 filas.
3. Mostrar por pantalla los datos del pasajero con identificador 148.
3. Mostrar por pantalla las filas pares del DataFrame.
4. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.
5. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron.
5. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.
6. Eliminar del DataFrame los pasajeros con edad desconocida.
7. Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.
8.  Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.
9.  Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [ ]:
! pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas) (2022.7.1)
Requirement already satisfied: tzdata>=2022.1 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [ ]:
#Librerias
import pandas as pd
import numpy as np

# Solución

In [ ]:
pwd

## 1. Generar un DataFrame con los datos del fichero.

In [ ]:
titanic = pd.read_csv('titanic.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
titanic = pd.read_csv('titanic.csv', index_col=0)
titanic

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## 2. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas.

In [ ]:
# Dimensiones del DataFrame
print('Dimensiones:', titanic.shape)
print('Filas:', len(titanic))
print('Columnas:',len(titanic.columns))

Dimensiones: (891, 11)
Filas: 891
Columnas: 11

In [ ]:
# Número de datos que contiene
print('Número de elementos:', titanic.size)

Número de elementos: 9801

In [ ]:
# Nombres de sus columnas
titanic.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
# Nombres de sus fila
titanic.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
      dtype='int64', name='PassengerId', length=891)

In [ ]:
# Tipos de datos de las columnas
titanic.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [ ]:
# 5 primeras filas
titanic.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [ ]:
# 5 últimas filas.
titanic.tail(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
# Muestra aleatoria de 5 filas
titanic.sample(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
231,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.0,1,0,36973,83.4750,C83,S
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
106,0,3,"Mionoff, Mr. Stoytcho",male,28.0,0,0,349207,7.8958,NaN,S
83,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,330932,7.7875,NaN,Q

## 3. Mostrar por pantalla los datos del pasajero con identificador 148.

In [ ]:
# Mostrar por pantalla los datos del pasajero con identificador 148
titanic.loc[[148]]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.375,NaN,S

## 4. Mostrar por pantalla las filas pares del DataFrame.

In [ ]:
# Mostrar por pantalla las filas pares del DataFrame.
for i in range(0,10,2):
    print(i)

0
2
4
6
8

In [ ]:
list(range(0,10,2))

[0, 2, 4, 6, 8]

In [ ]:
mascara = range(2,10,2)
titanic.loc[mascara]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [ ]:
np.arange(1,10,2)

array([1, 3, 5, 7, 9])

In [ ]:
# Mostrar por pantalla las filas pares del DataFrame.
mascara2 = np.arange(1,10,2)
titanic.iloc[mascara2]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

## 5. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.

In [ ]:
titanic["Pclass"]==1

PassengerId
1      False
2       True
3      False
4       True
5      False
       ...
887    False
888     True
889    False
890     True
891    False
Name: Pclass, Length: 891, dtype: bool

In [ ]:
mascara=titanic["Pclass"]==1
df_Pclass1 = titanic[mascara]
df_Pclass1

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...
872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [ ]:
mascara=titanic["Pclass"]==1
titanic[mascara]['Name']

PassengerId
2      Cumings, Mrs. John Bradley (Florence Briggs Th...
4           Futrelle, Mrs. Jacques Heath (Lily May Peel)
7                                McCarthy, Mr. Timothy J
12                              Bonnell, Miss. Elizabeth
24                          Sloper, Mr. William Thompson
                             ...
872     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
873                             Carlsson, Mr. Frans Olof
880        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
888                         Graham, Miss. Margaret Edith
890                                Behr, Mr. Karl Howell
Name: Name, Length: 216, dtype: object

In [ ]:
titanic[mascara]['Name'].sort_values()

PassengerId
731                      Allen, Miss. Elisabeth Walton
306                     Allison, Master. Hudson Trevor
298                       Allison, Miss. Helen Loraine
499    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
461                                Anderson, Mr. Harry
                            ...
156                        Williams, Mr. Charles Duane
352             Williams-Lambert, Mr. Fletcher Fellows
56                                   Woolner, Mr. Hugh
556                                 Wright, Mr. George
326                           Young, Miss. Marie Grice
Name: Name, Length: 216, dtype: object

## 6. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron

In [ ]:
titanic['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [ ]:
titanic['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [ ]:
549+342

891

In [ ]:
titanic['Survived'].count()

891

In [ ]:
num_total = titanic['Survived'].count()
num_total = len(titanic)
titanic['Survived'].value_counts()/num_total*100

Survived
0    61.616162
1    38.383838
Name: count, dtype: float64

In [ ]:
titanic['Survived'].value_counts()/titanic['Survived'].count()*100

Survived
0    61.616162
1    38.383838
Name: count, dtype: float64

In [ ]:
titanic['Survived'].value_counts(normalize=True)*100

Survived
0    61.616162
1    38.383838
Name: proportion, dtype: float64

In [ ]:
# Forma 1
print(titanic['Survived'].value_counts()/titanic['Survived'].count() * 100)
print('')
print('Sobrevivieron:',titanic['Survived'].value_counts()[1]/len(titanic['Survived'])*100 )
print('Murieron:',titanic['Survived'].value_counts()[0]/len(titanic['Survived'])*100 )

Survived
0    61.616162
1    38.383838
Name: count, dtype: float64

Sobrevivieron: 38.38383838383838
Murieron: 61.61616161616161

In [ ]:
# Forma 2
print(titanic['Survived'].value_counts(normalize=True) * 100)
print('')
print('Sobrevivieron:',titanic['Survived'].value_counts(normalize=True)[1] * 100 )
print('Murieron:',titanic['Survived'].value_counts(normalize=True)[0] * 100 )

Survived
0    61.616162
1    38.383838
Name: proportion, dtype: float64

Sobrevivieron: 38.38383838383838
Murieron: 61.61616161616161

## 7. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.

In [ ]:
titanic.groupby('Pclass')

In [ ]:
titanic.groupby('Pclass').count()

        Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1            216   216  216  186    216    216     216   216    176       214
2            184   184  184  173    184    184     184   184     16       184
3            491   491  491  355    491    491     491   491     12       491

In [ ]:
titanic.groupby('Pclass').value_counts()

Pclass  Survived  Name                                                 Sex     Age   SibSp  Parch  Ticket             Fare      Cabin    Embarked
1       0         Allison, Miss. Helen Loraine                         female  2.0   1      2      113781             151.5500  C22 C26  S           1
        1         Hoyt, Mr. Frederick Maxfield                         male    38.0  1      0      19943              90.0000   C93      S           1
                  Kimball, Mr. Edwin Nelson Jr                         male    42.0  1      0      11753              52.5542   D19      S           1
                  Leader, Dr. Alice (Farnham)                          female  49.0  0      0      17465              25.9292   D17      S           1
                  Lesurer, Mr. Gustave J                               male    35.0  0      0      PC 17755           512.3292  B101     C           1
                                                                                                                                                    ..
3       1         Moor, Master. Meier                                  male    6.0   0      1      392096             12.4750   E121     S           1
                  Moor, Mrs. (Beila)                                   female  27.0  0      1      392096             12.4750   E121     S           1
                  Pickard, Mr. Berk (Berk Trembisky)                   male    32.0  0      0      SOTON/O.Q. 392078  8.0500    E10      S           1
                  Sandstrom, Miss. Marguerite Rut                      female  4.0   1      1      PP 9549            16.7000   G6       S           1
                  Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengtsson)  female  24.0  0      2      PP 9549            16.7000   G6       S           1
Name: count, Length: 183, dtype: int64

In [ ]:
titanic.groupby('Pclass')[['Survived','Sex']].value_counts()

Pclass  Survived  Sex
1       1         female     91
        0         male       77
        1         male       45
        0         female      3
2       0         male       91
        1         female     70
                  male       17
        0         female      6
3       0         male      300
                  female     72
        1         female     72
                  male       47
Name: count, dtype: int64

In [ ]:
titanic.groupby('Pclass')['Survived'].value_counts(normalize=True)*100

Pclass  Survived
1       1           62.962963
        0           37.037037
2       0           52.717391
        1           47.282609
3       0           75.763747
        1           24.236253
Name: proportion, dtype: float64

## 8. Eliminar del DataFrame los pasajeros con edad desconocida.

In [ ]:
len(titanic)

891

In [ ]:
titanic.dropna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [ ]:
len(titanic.dropna())

183

In [ ]:
len(titanic.dropna(subset=['Age']))

714

In [ ]:
len(titanic)

891

In [ ]:
df_titanic = titanic.copy()
df_titanic2 = titanic

In [ ]:
titanic.dropna(subset=['Age'],inplace=True) # titanic = titanic.dropna(subset=['Age'])
len(titanic)

714

In [ ]:
titanic = titanic.dropna(subset=['Age'])

In [ ]:
len(df_titanic)

714

In [ ]:
len(df_titanic2)

714

## 9. Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.

In [ ]:
titanic.groupby(['Pclass','Sex']).count()

               PassengerId  Survived  Name  Age  SibSp  Parch  Ticket  Fare
Pclass Sex
1      female           85        85    85   85     85     85      85    85  \
       male            101       101   101  101    101    101     101   101
2      female           74        74    74   74     74     74      74    74
       male             99        99    99   99     99     99      99    99
3      female          102       102   102  102    102    102     102   102
       male            253       253   253  253    253    253     253   253

               Cabin  Embarked
Pclass Sex
1      female     76        83
       male       84       101
2      female      9        74
       male        6        99
3      female      5       102
       male        5       253

In [ ]:
mascara=titanic['Sex']=='female'
female_df=titanic[mascara]
female_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [ ]:
female_df.groupby(['Pclass']).value_counts()

Pclass  PassengerId  Survived  Name                                                   Sex     Age   SibSp  Parch  Ticket    Fare      Cabin  Embarked
1       2            1         Cumings, Mrs. John Bradley (Florence Briggs Thayer)    female  38.0  1      0      PC 17599  71.2833   C85    C           1
        4            1         Futrelle, Mrs. Jacques Heath (Lily May Peel)           female  35.0  1      0      113803    53.1000   C123   S           1
        782          1         Dick, Mrs. Albert Adrian (Vera Gillespie)              female  17.0  1      0      17474     57.0000   B20    S           1
        780          1         Robert, Mrs. Edward Scott (Elisabeth Walton McMillan)  female  43.0  0      1      24160     211.3375  B3     S           1
        766          1         Hogeboom, Mrs. John C (Anna Andrews)                   female  51.0  1      0      13502     77.9583   D11    S           1
                                                                                                                                                        ..
3       395          1         Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengtsson)    female  24.0  0      2      PP 9549   16.7000   G6     S           1
        252          0         Strom, Mrs. Wilhelm (Elna Matilda Persson)             female  29.0  1      1      347054    10.4625   G6     S           1
        206          0         Strom, Miss. Telma Matilda                             female  2.0   0      1      347054    10.4625   G6     S           1
        11           1         Sandstrom, Miss. Marguerite Rut                        female  4.0   1      1      PP 9549   16.7000   G6     S           1
        824          1         Moor, Mrs. (Beila)                                     female  27.0  0      1      392096    12.4750   E121   S           1
Name: count, Length: 88, dtype: int64

In [ ]:
female_df.groupby(['Pclass'])['Age'].value_counts()

Pclass  Age
1       35.0    6
        30.0    5
        24.0    5
        39.0    4
        22.0    4
               ..
3       38.0    1
        35.0    1
        37.0    1
        3.0     1
        63.0    1
Name: count, Length: 127, dtype: int64

In [ ]:
female_df.groupby(['Pclass'])['Age'].describe()

        count       mean        std   min     25%   50%    75%   max
Pclass
1        85.0  34.611765  13.612052  2.00  23.000  35.0  44.00  63.0
2        74.0  28.722973  12.872702  2.00  22.250  28.0  36.00  57.0
3       102.0  21.750000  12.729964  0.75  14.125  21.5  29.75  63.0

In [ ]:
# Calculando solo la edad media
female_df.groupby(['Pclass'])['Age'].mean()

Pclass
1    34.611765
2    28.722973
3    21.750000
Name: Age, dtype: float64

## 10. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.

In [ ]:
titanic['Age'] < 18

0      False
1      False
2      False
3      False
4      False
       ...
885    False
886    False
887    False
889    False
890    False
Name: Age, Length: 714, dtype: bool

In [ ]:
titanic['Young'] = titanic['Age'] < 18

In [ ]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Young
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,False
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,False
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,False
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,False

In [ ]:
titanic['Young'].value_counts()

Young
False    601
True     113
Name: count, dtype: int64

## 11. Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [ ]:
titanic.groupby(['Pclass', 'Young']).count()

              PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket
Pclass Young
1      False          174       174   174  174  174    174    174     174  \
       True            12        12    12   12   12     12     12      12
2      False          150       150   150  150  150    150    150     150
       True            23        23    23   23   23     23     23      23
3      False          277       277   277  277  277    277    277     277
       True            78        78    78   78   78     78     78      78

              Fare  Cabin  Embarked
Pclass Young
1      False   174    148       172
       True     12     12        12
2      False   150     11       150
       True     23      4        23
3      False   277      7       277
       True     78      3        78

In [ ]:
titanic.groupby(['Pclass', 'Young'])['Survived'].count()

Pclass  Young
1       False    174
        True      12
2       False    150
        True      23
3       False    277
        True      78
Name: Survived, dtype: int64

In [ ]:
titanic.groupby(['Pclass', 'Young'])['Survived'].value_counts(normalize = True)*100

Pclass  Young  Survived
1       False  1           63.793103
               0           36.206897
        True   1           91.666667
               0            8.333333
2       False  0           58.666667
               1           41.333333
        True   1           91.304348
               0            8.695652
3       False  0           79.783394
               1           20.216606
        True   0           62.820513
               1           37.179487
Name: proportion, dtype: float64